{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"indices:0": {"name": "indices:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "values:0": {"name": "values:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"module_apply_default/Encoder_en/hidden_layers/l2_normalize:0": {"name": "module_apply_default/Encoder_en/hidden_layers/l2_normalize:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}}}}, "modelTopology": {"node": [{"name": "module_apply_default/Encoder_en/KonaTransformer/SequenceMask/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/add_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1536"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/add_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1536"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/layer_norm_scale/ConcatPartitions/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Mean_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Cast/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/layer_norm_bias/ConcatPartitions/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ConstantFolding/module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/ListDiff-folded-0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/concat_2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/FFN/conv1/bias/ConcatPartitions/concat", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1536"}]}}}}}, {"name": "ConstantFolding/module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/ListDiff-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/concat_2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/FFN/conv2/bias/ConcatPartitions/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/Scatter/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/Scatter/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/Scatter/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/Scatter/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/combine_heads/combine_last_two_dimensions/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/combine_heads/combine_last_two_dimensions/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/combine_heads/combine_last_two_dimensions/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/BaseDotProductAttention/concat/values_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/BaseDotProductAttention/Slice/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/BaseDotProductAttention/Slice/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/BaseDotProductAttention/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_1/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/layer_prepostprocess/layer_norm/layer_norm_scale/ConcatPartitions/concat", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/layer_prepostprocess/layer_norm/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/layer_prepostprocess/layer_norm/Mean_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/layer_prepostprocess/layer_norm/Cast/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/layer_prepostprocess/layer_norm/layer_norm_bias/ConcatPartitions/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "module/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/MultiheadAttention/qkv_transform_single/kernel/part_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1536"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/MultiheadAttention/qkv_transform_single/bias/ConcatPartitions/concat", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1536"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_2/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/combine_heads/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/combine_heads/combine_last_two_dimensions/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/combine_heads/combine_last_two_dimensions/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/combine_heads/combine_last_two_dimensions/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/combine_heads/combine_last_two_dimensions/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/ExpandDims_1/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "module/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/MultiheadAttention/output_transform_single/kernel/part_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/MultiheadAttention/output_transform_single/bias/ConcatPartitions/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/add_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1536"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/add_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1536"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/FFN/layer_prepostprocess/layer_norm/layer_norm_scale/ConcatPartitions/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Mean_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Cast/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/FFN/layer_prepostprocess/layer_norm/layer_norm_bias/ConcatPartitions/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/ListDiff-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/concat_2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/FFN/conv1/bias/ConcatPartitions/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1536"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/ListDiff-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/concat_2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/FFN/conv2/bias/ConcatPartitions/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/Scatter/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/Scatter/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/Scatter/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/Scatter/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/combine_heads/combine_last_two_dimensions/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/combine_heads/combine_last_two_dimensions/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/combine_heads/combine_last_two_dimensions/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/DotProductAttention/BaseDotProductAttention/concat/values_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/DotProductAttention/BaseDotProductAttention/Slice/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/DotProductAttention/BaseDotProductAttention/Slice/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/DotProductAttention/BaseDotProductAttention/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/layer_prepostprocess/layer_norm/layer_norm_scale/ConcatPartitions/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/layer_prepostprocess/layer_norm/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/layer_prepostprocess/layer_norm/Mean_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/layer_prepostprocess/layer_norm/Cast/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/layer_prepostprocess/layer_norm/layer_norm_bias/ConcatPartitions/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/MultiheadAttention/qkv_transform_single/kernel/part_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/MultiheadAttention/qkv_transform_single/bias/ConcatPartitions/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": 